// Исходный массив

let array = [
    [5, -4, 9, 8, 'qwe', {name: 'qwe', age: 12}],
    ['asdsss', 'zxcv', 4, -76, 98, {isAdmin: true}],
    [23, 45, -76, 'asd', 'zxcvbn', 0.78]
];

function transform(matrix) { // Объявление функции
    matrix.forEach((row, rowIndex) => { // Перебор элементов массива. Каждый из этих элементон тоже является массивом
        row.forEach((item, itemIndex) => { // Перебор элементов вложенного массива
            if (item === Number(item)) { // Проверка элемента, является ли он числом
                if (item > 0 && Number.isInteger(item)) { // Проверка, что число положительное и целое
                    item = item * 2; // Если условия удовлетворены, то умножаем это число на 2
                } else if (Number(item) < 0) { // Проверка, что число отрицательное
                    item = item - 1; // Если условия удовлетворены, то отнимаем это 1
                }

            } else if (item === String(item)) { // Проверка элемента, является ли он строкой
                if (item.length % 2 !== 0) { // Проверка, что количество символов не чётное
                    item = 'Q'; // Если условия удовлетворены, то заменяем значение строки на Q
                } else {
                    item = 'Z'; // В противном случае заменяем значение строки на Z
                }
            }

            // console.log(item) // проверка
        });
    });
}

transform(array);